codeigniter/app/Controllers/Employee.php

    public function index()
    {
        $model = new EmployeeModel();
        $data['employees'] = $model->findAll();
---
SELECT *
FROM `employee`

    public function create()
    {
        $id = isset($_GET['id'])?$_GET['id']:'';
        $country_code_details = $this->countryCodeModel->find();
        $model = new EmployeeModel();
        $max_id = $this->employeeModel->max_id();
        $data['model'] = $model->find($id);
---
SELECT *
FROM `country_code`
SELECT *
FROM `employee`
WHERE `employee`.`id` = ''

    public function edit($id)
    {
        $model = new EmployeeModel();
        $country_code_details = $this->countryCodeModel->find();
        $data['model'] = $model->find($id);
---
SELECT *
FROM `country_code`
SELECT *
FROM `employee`
WHERE `employee`.`id` = '1'

    public function delete()
    {
        $id = isset($_POST['id'])?$_POST['id']:'';
        $model = new EmployeeModel();
        $model->delete($id);
---
DELETE FROM `employee`
WHERE `id` IN ('1')