codeigniter/app/Models/EmployeeModel.php

    public function max_id()
    {
		$data  = $this->db->table('employee')
                ->select("max(id) as max_id")
                ->get()->getRow();
---
SELECT max(id) as max_id
FROM `employee`